## Business Understanding

### `Project Description`
Imagine being at the helm of a business with a treasure trove of transactional data, brimming with untapped potential, yet unable to harness its power. That's where our client finds themselvesâ€”a company sitting on a goldmine of 2019 transactional data, eager to uncover insights that could propel their business to new heights. They've turned to us, seeking a transformative business intelligence solution that not only answers their pressing questions but also illuminates hidden opportunities to boost sales and streamline operations.

Enter getINNOtized, a dynamic organization dedicated to connecting talented data professionals with businesses in need of innovative data solutions. Through their platform, companies can leverage top-tier analytical expertise to unlock the full potential of their data. getINNOtized has assigned us this mission, confident in our ability to deliver a comprehensive, actionable business intelligence report that will empower the client to make informed, strategic decisions. Our task is clear: dive deep into this data, decode its secrets, and deliver insights that guide the client towards increased revenue and enhanced efficiency.

#### **Key Stakeholders**
The stakeholders include the client's company executives, sales and marketing team, product management team, logistics and supply chain team, IT and data team, getINNOtized and external stakeholders(investors and suppliers)

#### **Success Criteria**

The success of this project will be measured by the ability to deliver a detailed and actionable business intelligence report that answers the client's questions and provides insights for driving sales and efficiency. The report should be clear, visually appealing, and easy to understand, providing the client with a solid foundation for making data-driven decisions.

#### **Constraints and Considerations**

- Data Quality: Ensure the data is clean, accurate, and complete before analysis.
- Timeliness: The analysis and report should be delivered within the agreed-upon timeframe.
- Client Collaboration: Regular communication with the client to understand their needs and provide updates on progress.
- Tool Selection: Utilize appropriate data analysis and visualization tools to generate insights and present findings effectively.

#### **Data Requirements**
- Utilize data that was collected for each month in the entire year of 2019. The data for the first half of the year (January to June) was collected in excel and saved as csv files before management decided to use databases to store their data for analysis.

**<i>NB</i>** Additionally, categorize products based on their unit prices:
- Products with unit prices above $99.99 should be labeled as high-level products.
- Products with unit prices $99.99 and below should be labeled as basic-level products.

#### **Business Impact**
- Enhance customer satisfaction through better product availability.
- Optimize inventory management, leading to cost savings and improved operational efficiency.

### `Hypothesis`

*Null Hypothesis (Ho):* 

*Alternate Hypothesis (Ha):* 

### `Analytical Business Questions`

1. How much money did we make this year?
2. Can we identify any seasonality in the  sales?
3. What are our best and worst-selling products?
4. How do sales compare to previous months or weeks? 
5. Which cities are our products delivered to most? 
6. How do product categories compare in revenue generated and quantities  ordered?
7. You are required to show additional details from your findings in your data.

## Data Understanding

### `File Descriptions and Data Field Information`

|  Header  | Description        |
|:--------|:-------------|
| Order_ID   | Order ID number.    |
| Product    | Name of the product.  |
| Quantity_Ordered | How much was ordered per product     |
| Price_Each |  Price of each product.   |
| Order_Date   | The date the order was made.      |
| Purchase_Address | Address where the purchase was made.|

### `Importations`

In [97]:
# Import the necessary libraries

# Data Connection
import pyodbc
from dotenv import dotenv_values

# Data Manipulation
import numpy as np
import pandas as pd

# Data Visualization
import matplotlib.pyplot as plt
import seaborn as sns

# Stats Packages
from scipy.stats import stats


# Others
from datetime import datetime
import os
from itertools import product
pd.options.display.float_format = '{:.2f}'.format
import warnings
warnings.filterwarnings('ignore')

print("PACKAGE SUCCESS!! ðŸŽ‰")

PACKAGE SUCCESS!! ðŸŽ‰

### `Data Connection`

In [98]:
# Load environment variables from .env file into a dictionary
environment_variables=dotenv_values('.env')

# Get the values for the credentials you set in the '.env' file
server = environment_variables.get("server_name")
database = environment_variables.get("database_name")
username = environment_variables.get("user")
password = environment_variables.get("password")

connection_string=f"DRIVER={{SQL Server}};SERVER={server};DATABASE={database};UID={username};PWD={password}"

# Use the connect method of the pyodbc library and pass in the connection string.
connection = pyodbc.connect(connection_string)

In [99]:
# Get the cursor
# The connection cursor is used to execute statements to communicate with the MySQL database
cursor = connection.cursor()
# Retrieve the table names
table_names = cursor.tables(tableType='TABLE')
# Fetch all the table names
tables = table_names.fetchall()
# Print the table names
for table in tables:
    print(table.table_name)

Sales_August_2019
Sales_December_2019
Sales_July_2019
Sales_November_2019
Sales_October_2019
Sales_September_2019
change_streams_destination_type
change_streams_partition_scheme
trace_xe_action_map
trace_xe_event_map

In [100]:
# sql query to get the datasets
query = "SELECT * FROM Sales_August_2019"
query2 = "SELECT * FROM Sales_December_2019"
query3 = "SELECT * FROM Sales_July_2019"
query4 = "SELECT * FROM Sales_November_2019"
query5 = "SELECT * FROM Sales_October_2019"
query6 = "SELECT * FROM Sales_September_2019"

data=pd.read_sql(query,connection)
data2=pd.read_sql(query2,connection)
data3=pd.read_sql(query3,connection)
data4=pd.read_sql(query4,connection)
data5=pd.read_sql(query5,connection)
data6=pd.read_sql(query6,connection)

In [101]:
# save tables to csv
data.to_csv('data\Sales_August_2019.csv', index=False)
data2.to_csv('data\Sales_December_2019.csv', index=False)
data3.to_csv('data\Sales_July_2019.csv', index=False)
data4.to_csv('data\Sales_November_2019.csv', index=False)
data5.to_csv('data\Sales_October_2019.csv', index=False)
data6.to_csv('data\Sales_September_2019.csv', index=False)

In [102]:
# Read CSV and change date column from object to date type
sales_Aug = pd.read_csv("data\Sales_August_2019.csv", parse_dates =['Order_Date'])
sales_Dec = pd.read_csv("data\Sales_December_2019.csv", parse_dates =['Order_Date'])
sales_Jul = pd.read_csv("data\Sales_July_2019.csv",parse_dates=['Order_Date'])
sales_Nov = pd.read_csv("data\Sales_November_2019.csv",parse_dates=['Order_Date'])
sales_Oct = pd.read_csv("data\Sales_October_2019.csv",parse_dates=['Order_Date'])
sales_Sept = pd.read_csv("data\Sales_September_2019.csv",parse_dates=['Order_Date'])

In [103]:
# Remove microseconds by formatting the datetime without microseconds
sales_Aug['Order_Date'] = sales_Aug['Order_Date'].dt.floor('S')
sales_Dec['Order_Date'] = sales_Dec['Order_Date'].dt.floor('S')
sales_Jul['Order_Date'] = sales_Jul['Order_Date'].dt.floor('S')
sales_Nov['Order_Date'] = sales_Nov['Order_Date'].dt.floor('S')
sales_Oct['Order_Date'] = sales_Oct['Order_Date'].dt.floor('S')
sales_Sept['Order_Date'] = sales_Sept['Order_Date'].dt.floor('S')

In [104]:
# Concatenate the datasets
data_second_half = pd.concat([
    sales_Aug,
    sales_Dec,
    sales_Jul,
    sales_Nov,
    sales_Oct,
    sales_Sept
], ignore_index=True)

In [105]:
data_second_half.head()

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address
0,236670.00,Wired Headphones,2.00,11.99,2031-08-19 22:21:00,"359 Spruce St, Seattle, WA 98101"
1,236671.00,Bose SoundSport Headphones,1.00,99.99,2015-08-19 15:11:00,"492 Ridge St, Dallas, TX 75001"
2,236672.00,iPhone,1.00,700.00,2006-08-19 14:40:00,"149 7th St, Portland, OR 97035"
3,236673.00,AA Batteries (4-pack),2.00,3.84,2029-08-19 20:59:00,"631 2nd St, Los Angeles, CA 90001"
4,236674.00,AA Batteries (4-pack),2.00,3.84,2015-08-19 19:53:00,"736 14th St, New York City, NY 10001"

In [106]:
# Remove leading/trailing spaces from column names for all DataFrames
dataframes = [sales_Aug, sales_Dec, sales_Jul, sales_Nov, sales_Oct, sales_Sept]
for df in dataframes:
    df.columns = df.columns.str.strip()

def fill_missing_object_columns(df):
    # Iterate through each column in the DataFrame
    for col in df.columns:
        # Check if the column data type is object
        if df[col].dtype == 'object':
            # Fill missing values with NaN
            df[col] = df[col].fillna(np.nan)
    return df

# Apply the function to each DataFrame
sales_Aug = fill_missing_object_columns(sales_Aug)
sales_Dec = fill_missing_object_columns(sales_Dec)
sales_Jul = fill_missing_object_columns(sales_Jul)
sales_Nov = fill_missing_object_columns(sales_Nov)
sales_Oct = fill_missing_object_columns(sales_Oct)
sales_Sept = fill_missing_object_columns(sales_Sept)

### `Loading and concating First 6 months of the data`

In [107]:


# Define the path to the data directory
data_dir = 'data'

# List of months with correct file names
files = [
    'Sales_January_2019.csv',
    'Sales_February_2019.csv',
    'Sales_March_2019.csv',
    'Sales_April_2019.csv',
    'Sales_May_2019.csv',
    'Sales_June_2019.csv'
]

# Initialize a list to hold the DataFrames
dfs = []

# Loop through each file, read the corresponding CSV file, and append to the list
for file_name in files:
    file_path = os.path.join(data_dir, file_name)
    df = pd.read_csv(file_path)
    dfs.append(df)

# Concatenate all DataFrames into a single DataFrame
data_first_half = pd.concat(dfs, ignore_index=True)

# Optional: Check the first few rows of the concatenated DataFrame
data_first_half.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,2019-01-22 21:25:00,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,2019-01-28 14:15:00,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,2019-01-17 13:33:00,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,2019-01-05 20:33:00,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,2019-01-25 11:59:00,"387 10th St, Austin, TX 73301"

In [108]:
data_first_half.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 85625 entries, 0 to 85624
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          85380 non-null  object
 1   Product           85380 non-null  object
 2   Quantity Ordered  85380 non-null  object
 3   Price Each        85380 non-null  object
 4   Order Date        85380 non-null  object
 5   Purchase Address  85380 non-null  object
dtypes: object(6)
memory usage: 3.9+ MB

In [109]:
data_first_half.isnull().sum()

Order ID            245
Product             245
Quantity Ordered    245
Price Each          245
Order Date          245
Purchase Address    245
dtype: int64

In [110]:
data_second_half.head()

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address
0,236670.00,Wired Headphones,2.00,11.99,2031-08-19 22:21:00,"359 Spruce St, Seattle, WA 98101"
1,236671.00,Bose SoundSport Headphones,1.00,99.99,2015-08-19 15:11:00,"492 Ridge St, Dallas, TX 75001"
2,236672.00,iPhone,1.00,700.00,2006-08-19 14:40:00,"149 7th St, Portland, OR 97035"
3,236673.00,AA Batteries (4-pack),2.00,3.84,2029-08-19 20:59:00,"631 2nd St, Los Angeles, CA 90001"
4,236674.00,AA Batteries (4-pack),2.00,3.84,2015-08-19 19:53:00,"736 14th St, New York City, NY 10001"

In [111]:
data_second_half.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101225 entries, 0 to 101224
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order_ID          100730 non-null  float64
 1   Product           100925 non-null  object
 2   Quantity_Ordered  100730 non-null  float64
 3   Price_Each        100730 non-null  float64
 4   Order_Date        100730 non-null  datetime64[ns]
 5   Purchase_Address  100925 non-null  object
dtypes: datetime64[ns](1), float64(3), object(2)
memory usage: 4.6+ MB

In [112]:
data_second_half.isnull().sum()

Order_ID            495
Product             300
Quantity_Ordered    495
Price_Each          495
Order_Date          495
Purchase_Address    300
dtype: int64

#### Key observations/insights from data
- Orderdate column has data inconsistencies e.g 2031 which is practically impossible. It will be handled in the next step i.e data cleaning
- Quantity orderd in the seconf half dataset is in float, it should be converted  to integer.
- A new categorical column shall be created for high-level and low-level products
- We have missing values from both first half and second half
- The order date format is in object format when it should be in datetime
- Columns in the second half does no match columns in the second half

### `Data Cleaning`

#### Handling the date column

In [113]:
# Function to clean and reformat the date
def clean_date(date_str):
    try:
        # Convert string to datetime
        dt = pd.to_datetime(date_str, format='%Y-%m-%d %H:%M:%S')
        # Remove '20' from the year and reformat
        return dt.strftime('%d-%m-%y %H:%M:%S')
    except Exception as e:
        return date_str  # Return original if there's an error

# Apply the function to the 'Order_Date' column
data_second_half['Order_Date'] = data_second_half['Order_Date'].apply(clean_date)

# Display the cleaned DataFrame
data_second_half.head()

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address
0,236670.00,Wired Headphones,2.00,11.99,19-08-31 22:21:00,"359 Spruce St, Seattle, WA 98101"
1,236671.00,Bose SoundSport Headphones,1.00,99.99,19-08-15 15:11:00,"492 Ridge St, Dallas, TX 75001"
2,236672.00,iPhone,1.00,700.00,19-08-06 14:40:00,"149 7th St, Portland, OR 97035"
3,236673.00,AA Batteries (4-pack),2.00,3.84,19-08-29 20:59:00,"631 2nd St, Los Angeles, CA 90001"
4,236674.00,AA Batteries (4-pack),2.00,3.84,19-08-15 19:53:00,"736 14th St, New York City, NY 10001"

In [114]:
# Convert Order_Date to datetime with the current format
data_second_half['Order_Date'] = pd.to_datetime(data_second_half['Order_Date'], format='%y-%m-%d %H:%M:%S')

# Convert to the desired format (m/d/yy)
data_second_half['Order_Date'] = data_second_half['Order_Date'].dt.strftime('%m/%d/%y %H:%M:%S')

# Display the cleaned DataFrame
data_second_half

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address
0,236670.00,Wired Headphones,2.00,11.99,08/31/19 22:21:00,"359 Spruce St, Seattle, WA 98101"
1,236671.00,Bose SoundSport Headphones,1.00,99.99,08/15/19 15:11:00,"492 Ridge St, Dallas, TX 75001"
2,236672.00,iPhone,1.00,700.00,08/06/19 14:40:00,"149 7th St, Portland, OR 97035"
3,236673.00,AA Batteries (4-pack),2.00,3.84,08/29/19 20:59:00,"631 2nd St, Los Angeles, CA 90001"
4,236674.00,AA Batteries (4-pack),2.00,3.84,08/15/19 19:53:00,"736 14th St, New York City, NY 10001"
...,...,...,...,...,...,...
101220,259353.00,AAA Batteries (4-pack),3.00,2.99,09/17/19 20:56:00,"840 Highland St, Los Angeles, CA 90001"
101221,259354.00,iPhone,1.00,700.00,09/01/19 16:00:00,"216 Dogwood St, San Francisco, CA 94016"
101222,259355.00,iPhone,1.00,700.00,09/23/19 07:39:00,"220 12th St, San Francisco, CA 94016"
101223,259356.00,34in Ultrawide Monitor,1.00,379.99,09/19/19 17:30:00,"511 Forest St, San Francisco, CA 94016"
101224,259357.00,USB-C Charging Cable,1.00,11.95,09/30/19 00:18:00,"250 Meadow St, San Francisco, CA 94016"

#### Concate the first and second half datasets

In [115]:
# Rename columns in the second half to match the first half
data_second_half.rename(columns={
    'Order_ID': 'Order ID',
    'Quantity_Ordered': 'Quantity Ordered',
    'Price_Each': 'Price Each',
    'Order_Date': 'Order Date',
    'Purchase_Address': 'Purchase Address'
}, inplace=True)

# Concatenate the datasets
combined_data = pd.concat([data_first_half, data_second_half], ignore_index=True)

# Display the combined DataFrame
combined_data

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,2019-01-22 21:25:00,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,2019-01-28 14:15:00,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,2019-01-17 13:33:00,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,2019-01-05 20:33:00,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,2019-01-25 11:59:00,"387 10th St, Austin, TX 73301"
...,...,...,...,...,...,...
186845,259353.00,AAA Batteries (4-pack),3.00,2.99,09/17/19 20:56:00,"840 Highland St, Los Angeles, CA 90001"
186846,259354.00,iPhone,1.00,700.00,09/01/19 16:00:00,"216 Dogwood St, San Francisco, CA 94016"
186847,259355.00,iPhone,1.00,700.00,09/23/19 07:39:00,"220 12th St, San Francisco, CA 94016"
186848,259356.00,34in Ultrawide Monitor,1.00,379.99,09/19/19 17:30:00,"511 Forest St, San Francisco, CA 94016"
186849,259357.00,USB-C Charging Cable,1.00,11.95,09/30/19 00:18:00,"250 Meadow St, San Francisco, CA 94016"

In [116]:
# Display the combined DataFrame
combined_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,2019-01-22 21:25:00,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,2019-01-28 14:15:00,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,2019-01-17 13:33:00,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,2019-01-05 20:33:00,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,2019-01-25 11:59:00,"387 10th St, Austin, TX 73301"

In [117]:
combined_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 186850 entries, 0 to 186849
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          186110 non-null  object
 1   Product           186305 non-null  object
 2   Quantity Ordered  186110 non-null  object
 3   Price Each        186110 non-null  object
 4   Order Date        186110 non-null  object
 5   Purchase Address  186305 non-null  object
dtypes: object(6)
memory usage: 8.6+ MB

In [118]:
combined_data.isnull().sum()

Order ID            740
Product             545
Quantity Ordered    740
Price Each          740
Order Date          740
Purchase Address    545
dtype: int64

#### Handle missing values

- Check for null rows

In [119]:
# Check for rows with any missing values
null_rows = combined_data[combined_data.isnull().any(axis=1)]

# Display the number of such rows and the rows themselves
print(f'Number of rows with any missing values: {len(null_rows)}')
print(null_rows.head())  # Display first few rows with missing values

Number of rows with any missing values: 740
     Order ID Product Quantity Ordered Price Each Order Date Purchase Address
664       NaN     NaN              NaN        NaN        NaN              NaN
678       NaN     NaN              NaN        NaN        NaN              NaN
797       NaN     NaN              NaN        NaN        NaN              NaN
876       NaN     NaN              NaN        NaN        NaN              NaN
1299      NaN     NaN              NaN        NaN        NaN              NaN

In [120]:
# Find rows where all columns have missing values
all_missing_rows = combined_data[combined_data.isnull().all(axis=1)]

# Display the number of such rows and the rows themselves
print(f'Number of rows with all missing values: {len(all_missing_rows)}')
all_missing_rows

Number of rows with all missing values: 545

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
664,NaN,NaN,NaN,NaN,NaN,NaN
678,NaN,NaN,NaN,NaN,NaN,NaN
797,NaN,NaN,NaN,NaN,NaN,NaN
876,NaN,NaN,NaN,NaN,NaN,NaN
1299,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...
185176,NaN,NaN,NaN,NaN,NaN,NaN
185438,NaN,NaN,NaN,NaN,NaN,NaN
186042,NaN,NaN,NaN,NaN,NaN,NaN
186548,NaN,NaN,NaN,NaN,NaN,NaN
186826,NaN,NaN,NaN,NaN,NaN,NaN

#### Dropping columns with all missing values

In [121]:
# Drop rows where all columns have missing values
combined_data = combined_data.dropna(how='all')

# Verify the shape of the DataFrame after dropping rows
combined_data.shape

(186305, 6)

#### Check remaining missing values

In [122]:
# Check for rows with any missing values
null_rows = combined_data[combined_data.isnull().any(axis=1)]

# Display the number of such rows and the rows themselves
print(f'Number of rows with any missing values: {len(null_rows)}')
null_rows # Display first few rows with missing values

Number of rows with any missing values: 195

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
85836,NaN,Product,NaN,NaN,NaN,Purchase Address
85868,NaN,Product,NaN,NaN,NaN,Purchase Address
86916,NaN,Product,NaN,NaN,NaN,Purchase Address
87037,NaN,Product,NaN,NaN,NaN,Purchase Address
87052,NaN,Product,NaN,NaN,NaN,Purchase Address
...,...,...,...,...,...,...
185164,NaN,Product,NaN,NaN,NaN,Purchase Address
185551,NaN,Product,NaN,NaN,NaN,Purchase Address
186563,NaN,Product,NaN,NaN,NaN,Purchase Address
186632,NaN,Product,NaN,NaN,NaN,Purchase Address
186738,NaN,Product,NaN,NaN,NaN,Purchase Address

- We delete the remaining rows with missing values since the given info is not meaningfull

In [123]:
# Drop rows with any missing values
combined_data_cleaned = combined_data.dropna(how='any')

# Verify the shape of the DataFrame after dropping rows
print(combined_data_cleaned.shape)

(186110, 6)

In [124]:
combined_data_cleaned.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,2019-01-22 21:25:00,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,2019-01-28 14:15:00,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,2019-01-17 13:33:00,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,2019-01-05 20:33:00,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,2019-01-25 11:59:00,"387 10th St, Austin, TX 73301"

In [125]:
combined_data_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
Index: 186110 entries, 0 to 186849
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          186110 non-null  object
 1   Product           186110 non-null  object
 2   Quantity Ordered  186110 non-null  object
 3   Price Each        186110 non-null  object
 4   Order Date        186110 non-null  object
 5   Purchase Address  186110 non-null  object
dtypes: object(6)
memory usage: 9.9+ MB

In [126]:
combined_data_cleaned.isnull().sum()

Order ID            0
Product             0
Quantity Ordered    0
Price Each          0
Order Date          0
Purchase Address    0
dtype: int64

In [127]:
combined_data_cleaned['Quantity Ordered'].unique()

array(['1', '2', '3', '5', '4', '7', 'Quantity Ordered', '6', '9', 2.0,
       1.0, 3.0, 4.0, 6.0, 7.0, 5.0, 8.0, 9.0], dtype=object)

In [128]:
# Convert 'Quantity Ordered' to string first
combined_data_cleaned['Quantity Ordered'] = combined_data_cleaned['Quantity Ordered'].astype(str)

# Identify non-numeric values
non_numeric_quantity = combined_data_cleaned[pd.to_numeric(combined_data_cleaned['Quantity Ordered'], errors='coerce').isna()]

non_numeric_quantity

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1073,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1102,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1194,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1897,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
2463,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
...,...,...,...,...,...,...
82446,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
82787,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
82816,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
83050,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
85307,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address

#### Observations
- No null values
- incorrect  feature formats
- non_numeric quantities

#### Drop non-numeric quantity

In [129]:
# Convert 'Quantity Ordered' to string first
combined_data_cleaned['Quantity Ordered'] = combined_data_cleaned['Quantity Ordered'].astype(str)

# Identify non-numeric values
non_numeric_quantity = pd.to_numeric(combined_data_cleaned['Quantity Ordered'], errors='coerce').isna()

# Drop rows with non-numeric 'Quantity Ordered'
combined_data_cleaned = combined_data_cleaned[~non_numeric_quantity]

# Reset index if needed
combined_data_cleaned.reset_index(drop=True, inplace=True)

combined_data_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 185950 entries, 0 to 185949
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          185950 non-null  object
 1   Product           185950 non-null  object
 2   Quantity Ordered  185950 non-null  object
 3   Price Each        185950 non-null  object
 4   Order Date        185950 non-null  object
 5   Purchase Address  185950 non-null  object
dtypes: object(6)
memory usage: 8.5+ MB

In [130]:
combined_data_cleaned['Quantity Ordered'].unique()

array(['1', '2', '3', '5', '4', '7', '6', '9', '2.0', '1.0', '3.0', '4.0',
       '6.0', '7.0', '5.0', '8.0', '9.0'], dtype=object)

In [131]:
# Convert 'Order Date' to datetime
combined_data_cleaned['Order Date'] = pd.to_datetime(combined_data_cleaned['Order Date'], errors='coerce')

In [132]:
# Remove non-numeric values
combined_data_cleaned['Quantity Ordered'] = pd.to_numeric(combined_data_cleaned['Quantity Ordered'], errors='coerce')

# Drop rows where 'Quantity Ordered' could not be converted to a number
combined_data_cleaned = combined_data_cleaned.dropna(subset=['Quantity Ordered'])

# Convert 'Quantity Ordered' to integer
combined_data_cleaned['Quantity Ordered'] = combined_data_cleaned['Quantity Ordered'].astype(int)

# Check the updated DataFrame info
combined_data_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 185950 entries, 0 to 185949
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          185950 non-null  object
 1   Product           185950 non-null  object
 2   Quantity Ordered  185950 non-null  int64
 3   Price Each        185950 non-null  object
 4   Order Date        85220 non-null   datetime64[ns]
 5   Purchase Address  185950 non-null  object
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 8.5+ MB

In [133]:
# Convert 'Price Each' to float
combined_data_cleaned['Price Each'] = combined_data_cleaned['Price Each'].astype(float)

# Verify the changes
combined_data_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 185950 entries, 0 to 185949
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          185950 non-null  object
 1   Product           185950 non-null  object
 2   Quantity Ordered  185950 non-null  int64
 3   Price Each        185950 non-null  float64
 4   Order Date        85220 non-null   datetime64[ns]
 5   Purchase Address  185950 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 8.5+ MB

In [134]:
combined_data_cleaned.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700.00,2019-01-22 21:25:00,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,2019-01-28 14:15:00,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,2019-01-17 13:33:00,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,2019-01-05 20:33:00,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,2019-01-25 11:59:00,"387 10th St, Austin, TX 73301"

#### Check for Duplicates

In [135]:
# Identify duplicate rows
duplicates = combined_data_cleaned[combined_data_cleaned.duplicated(keep=False)]
print(f"Number of duplicate rows: {len(duplicates)}")
print("Duplicate Rows:")
print(duplicates)

# Identify duplicates based on specific columns
duplicate_rows_based_on_columns = combined_data_cleaned[combined_data_cleaned.duplicated(subset=['Order ID', 'Order Date'], keep=False)]
print(f"Number of duplicate rows based on 'Order ID' and 'Order Date': {len(duplicate_rows_based_on_columns)}")
print("Duplicate Rows Based on 'Order ID' and 'Order Date':")
duplicate_rows_based_on_columns

Number of duplicate rows: 528
Duplicate Rows:
        Order ID                   Product  Quantity Ordered  Price Each  \
871       142071     AA Batteries (4-pack)                 1        3.84
872       142071     AA Batteries (4-pack)                 1        3.84
4105      145143  Lightning Charging Cable                 1       14.95
4106      145143  Lightning Charging Cable                 1       14.95
5784      146765              Google Phone                 1      600.00
...          ...                       ...               ...         ...
185613 259035.00          27in FHD Monitor                 1      149.99
185882 259296.00  Apple Airpods Headphones                 1      150.00
185883 259296.00  Apple Airpods Headphones                 1      150.00
185885 259297.00  Lightning Charging Cable                 1       14.95
185886 259297.00  Lightning Charging Cable                 1       14.95

                Order Date                           Purchase Address
871    2019-01-17 23:02:00               131 2nd St, Boston, MA 02215
872    2019-01-17 23:02:00               131 2nd St, Boston, MA 02215
4105   2019-01-06 03:01:00  182 Jefferson St, San Francisco, CA 94016
4106   2019-01-06 03:01:00  182 Jefferson St, San Francisco, CA 94016
5784   2019-01-21 11:23:00   918 Highland St, New York City, NY 10001
...                    ...                                        ...
185613                 NaT       327 Lake St, San Francisco, CA 94016
185882                 NaT               894 6th St, Dallas, TX 75001
185883                 NaT               894 6th St, Dallas, TX 75001
185885                 NaT              138 Main St, Boston, MA 02215
185886                 NaT              138 Main St, Boston, MA 02215

[528 rows x 6 columns]
Number of duplicate rows based on 'Order ID' and 'Order Date': 14649
Duplicate Rows Based on 'Order ID' and 'Order Date':

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
41,141275,USB-C Charging Cable,1,11.95,2019-01-07 16:06:00,"610 Walnut St, Austin, TX 73301"
42,141275,Wired Headphones,1,11.99,2019-01-07 16:06:00,"610 Walnut St, Austin, TX 73301"
57,141290,Apple Airpods Headphones,1,150.00,2019-01-02 08:25:00,"4 1st St, Los Angeles, CA 90001"
58,141290,AA Batteries (4-pack),3,3.84,2019-01-02 08:25:00,"4 1st St, Los Angeles, CA 90001"
133,141365,Vareebadd Phone,1,400.00,2019-01-10 11:19:00,"20 Dogwood St, New York City, NY 10001"
...,...,...,...,...,...,...
185893,259303.00,AA Batteries (4-pack),1,3.84,NaT,"106 7th St, Atlanta, GA 30301"
185904,259314.00,Wired Headphones,1,11.99,NaT,"241 Highland St, Atlanta, GA 30301"
185905,259314.00,AAA Batteries (4-pack),2,2.99,NaT,"241 Highland St, Atlanta, GA 30301"
185941,259350.00,Google Phone,1,600.00,NaT,"519 Maple St, San Francisco, CA 94016"
185942,259350.00,USB-C Charging Cable,1,11.95,NaT,"519 Maple St, San Francisco, CA 94016"

#### Drop identically duplicate rows

In [136]:
# Remove rows where all values across columns are identical, keeping only the first occurrence
combined_data_cleaned_no_duplicates = combined_data_cleaned.drop_duplicates(keep='first')

# Verify the number of rows after removing duplicates
print(f"Number of rows after removing exact duplicates: {len(combined_data_cleaned_no_duplicates)}")

Number of rows after removing exact duplicates: 185686

In [137]:
# Create a copy of combined_data_cleaned
df = combined_data_cleaned.copy()

# Data Cleaning

In [138]:
# Remove leading/trailing spaces from column names for all DataFrames
dataframes = [sales_Apr, sales_Feb, sales_Jan, sales_Jun, sales_Mar, sales_May]
for df in dataframes:
    df.columns = df.columns.str.strip()

# Function to clean and convert columns
def clean_and_convert(df, columns):
    for column in columns:
        # Remove leading/trailing spaces from the values (only if they are strings)
        if df[column].dtype == 'object':
            df[column] = df[column].str.strip()
        
        # Replace non-numeric values with NaN and convert to float
        df[column] = pd.to_numeric(df[column], errors='coerce')
    
    return df

# Columns to clean and convert
columns_to_convert = ['Order ID', 'Quantity Ordered', 'Price Each']

# Clean and convert the columns for each DataFrame
sales_Apr = clean_and_convert(sales_Apr, columns_to_convert)
sales_Feb = clean_and_convert(sales_Feb, columns_to_convert)
sales_Jan = clean_and_convert(sales_Jan, columns_to_convert)
sales_Jun = clean_and_convert(sales_Jun, columns_to_convert)
sales_Mar = clean_and_convert(sales_Mar, columns_to_convert)
sales_May = clean_and_convert(sales_May, columns_to_convert)

KeyError: 'Order ID'

In [ ]:
sales_May.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,194095.00,Wired Headphones,1.00,11.99,2019-05-16 17:14:00,"669 2nd St, New York City, NY 10001"
1,194096.00,AA Batteries (4-pack),1.00,3.84,2019-05-19 14:43:00,"844 Walnut St, Dallas, TX 75001"
2,194097.00,27in FHD Monitor,1.00,149.99,2019-05-24 11:36:00,"164 Madison St, New York City, NY 10001"
3,194098.00,Wired Headphones,1.00,11.99,2019-05-02 20:40:00,"622 Meadow St, Dallas, TX 75001"
4,194099.00,AAA Batteries (4-pack),2.00,2.99,2019-05-11 22:55:00,"17 Church St, Seattle, WA 98101"

In [ ]:
# Define the renaming dictionary
rename_dict = {
    'Order ID': 'Order_ID',
    'Quantity Ordered': 'Quantity_Ordered',
    'Price Each':'Price_Each',
    'Order Date':'Order_Date',
    'Purchase Address':'Purchase_Address',
}

# List of DataFrames
dataframes = [sales_Apr, sales_Feb, sales_Jan, sales_Jun, sales_Mar, sales_May]

# Rename columns in each DataFrame
for df in dataframes:
    df.rename(columns=rename_dict, inplace=True)

In [ ]:
#checking the dataframe
sales_May.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16635 entries, 0 to 16634
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order_ID          16554 non-null  float64
 1   Product           16587 non-null  object
 2   Quantity_Ordered  16554 non-null  float64
 3   Price_Each        16554 non-null  float64
 4   Order_Date        16587 non-null  object
 5   Purchase_Address  16587 non-null  object
dtypes: float64(3), object(3)
memory usage: 779.9+ KB

In [ ]:
def fill_missing_float_columns(df):
    # Iterate through each column in the DataFrame
    for col in df.columns:
        # Check if the column data type is float
        if df[col].dtype == 'float':
            # Fill missing values with NaN
            df[col] = df[col].fillna(np.nan)
    return df

# Apply the function to each DataFrame
sales_Apr = fill_missing_float_columns(sales_Apr)
sales_Feb = fill_missing_float_columns(sales_Feb)
sales_Jan = fill_missing_float_columns(sales_Jan)
sales_Jun = fill_missing_float_columns(sales_Jun)
sales_Mar = fill_missing_float_columns(sales_Mar)
sales_May = fill_missing_float_columns(sales_May)